In [1]:
import pandas as pd

In [2]:
data = {}

In [3]:
data['A'] = list(range(10))
data['B'] = list(range(10, 20))
data['C'] = list(range(20, 30))

In [4]:
df = pd.DataFrame(data)

In [5]:
df.head()

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

#### How would you use .iloc to get the first row of the DataFrame?

In [6]:
df.iloc[0]

A     0
B    10
C    20
Name: 0, dtype: int64

#### How would you use .iloc to get the last row of the DataFrame?

In [7]:
df.iloc[-1]

A     9
B    19
C    29
Name: 9, dtype: int64

#### How would you use .iloc to get the first 3 rows and the first 2 columns?

In [8]:
df.iloc[:3, :2]

   A   B
0  0  10
1  1  11
2  2  12

#### How would you use .iloc to get the last 2 rows and last 2 columns?

In [9]:
df.tail()

   A   B   C
5  5  15  25
6  6  16  26
7  7  17  27
8  8  18  28
9  9  19  29

In [10]:
df.iloc[-2:, -2:]

    B   C
8  18  28
9  19  29

#### How would you use .iloc to get all the rows but only the first column?

In [11]:
df.iloc[:, [0]]

   A
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

#### How would you use .iloc to get all the columns but only the third row?

In [12]:
df.iloc[2, :]

A     2
B    12
C    22
Name: 2, dtype: int64

#### How would you use .iloc to get rows from index 4 to index 6, inclusive, and only the second column?

In [13]:
df.iloc[4:7, [1]]

    B
4  14
5  15
6  16

#### How would you use .iloc to get the value at the fifth row and third column?

In [14]:
df.iloc[4, [2]]

C    24
Name: 4, dtype: int64

#### How would you use .iloc to get all rows for columns at index 0 and index 2?

In [15]:
df.iloc[:, [0, 2]]

   A   C
0  0  20
1  1  21
2  2  22
3  3  23
4  4  24
5  5  25
6  6  26
7  7  27
8  8  28
9  9  29

#### How would you use .iloc to update the value at the first row and first column to 99?

In [16]:
df.iloc[0, 0] = 99
df.head()

    A   B   C
0  99  10  20
1   1  11  21
2   2  12  22
3   3  13  23
4   4  14  24

#### How would you use .iloc to set all values in the last column to 0?

In [17]:
df.iloc[:, -1] = 0

In [18]:
df.head()

    A   B  C
0  99  10  0
1   1  11  0
2   2  12  0
3   3  13  0
4   4  14  0

#### How would you use .iloc to swap the first and last rows?

In [19]:
df.iloc[0], df.iloc[-1]

(A    99
 B    10
 C     0
 Name: 0, dtype: int64,
 A     9
 B    19
 C     0
 Name: 9, dtype: int64)

In [20]:
df

    A   B  C
0  99  10  0
1   1  11  0
2   2  12  0
3   3  13  0
4   4  14  0
5   5  15  0
6   6  16  0
7   7  17  0
8   8  18  0
9   9  19  0

In [27]:
temp = df.iloc[0].copy()
df.iloc[0] = df.iloc[-1] 
df.iloc[-1] = temp

#### How would you use .iloc to reverse the order of rows?

In [37]:
l = list(range(len(df)-1, -1, -1))
l
df.iloc[l]

    A   B  C
9   9  19  0
8   8  18  0
7   7  17  0
6   6  16  0
5   5  15  0
4   4  14  0
3   3  13  0
2   2  12  0
1   1  11  0
0  99  10  0

#### How would you use .iloc to get rows where the index is even and only the first column?

In [31]:
even_nums = range(0, len(df), 2)
df.iloc[even_nums, [0]]

    A
0  99
2   2
4   4
6   6
8   8

#### How would you use .iloc to get rows from index 2 to index 8 but only for columns at index 1 and index 2?

In [32]:
df.iloc[2:8, [1,2]]

    B  C
2  12  0
3  13  0
4  14  0
5  15  0
6  16  0
7  17  0